driver-tests/bpelse/xpathfunctions/XSDFunctions/src/marshal.wsdl

<?xml version="1.0" encoding="windows-1252"?>
<definitions name="marshal" targetNamespace="http://j2ee.netbeans.org/wsdl/marshal"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/marshal" xmlns:ns="http://sun.com/EmplInput" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/marshal">
            <xsd:import namespace="http://sun.com/EmplInput" schemaLocation="EmployeeInput.xsd"/>
        </xsd:schema>
    </types>
    <message name="marshalOperationRequest">
        <part name="part1" element="ns:EmployeeInput"/>
    </message>
    <message name="marshalOperationReply">
        <part name="part1" element="ns:EmployeeString"/>
    </message>
    <portType name="marshalPortType">
        <operation name="marshalOperation">
            <input name="input1" message="tns:marshalOperationRequest"/>
            <output name="output1" message="tns:marshalOperationReply"/>
        </operation>
    </portType>
    <binding name="marshalBinding" type="tns:marshalPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="marshalOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="marshalService">
        <port name="marshalPort" binding="tns:marshalBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/marshalService/marshalPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="marshal1">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="marshalPortTypeRole" portType="tns:marshalPortType"/>
    </plnk:partnerLinkType>
</definitions>
