driver-tests/bpelse/xpathfunctions/XSDFunctionsJBI/test/doUnMarshalTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:emp="http://sun.com/EmplInput">
  <soapenv:Body>
    <emp:EmployeeString>
      &lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;emp:EmployeeInput xmlns:emp="http://sun.com/EmplInput"&gt;
      &lt;EmployeeNumber&gt;1234&lt;/EmployeeNumber&gt;
      &lt;LastName&gt;Doe&lt;/LastName&gt;
      &lt;FirstName&gt;John&lt;/FirstName&gt;
      &lt;JobTitle&gt;Technical Member&lt;/JobTitle&gt;
      &lt;HoursWorked&gt;2000&lt;/HoursWorked&gt;
      &lt;PayRate&gt;30.0&lt;/PayRate&gt;
      &lt;/emp:EmployeeInput&gt;
    </emp:EmployeeString>
  </soapenv:Body>
</soapenv:Envelope>