driver-tests/bpelse/xpathfunctions/XSDFunctionsJBI/test/doMarshalTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:emp="http://sun.com/EmplInput">
  <soapenv:Body>
    <emp:EmployeeInput>
      <EmployeeNumber>1234</EmployeeNumber>
      <LastName>Doe</LastName>
      <FirstName>John</FirstName>
      <JobTitle>Technical Member</JobTitle>
      <HoursWorked>2000</HoursWorked>
      <PayRate>30.0</PayRate>
    </emp:EmployeeInput>
  </soapenv:Body>
</soapenv:Envelope>