driver-tests/bpelse/xpathfunctions/XSDFunctionsJBI/test/doMarshalTest/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <someNS:EmployeeString xmlns:someNS="http://sun.com/EmplInput">&lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;emp:EmployeeInput xmlns:emp="http://sun.com/EmplInput"&gt;
      &lt;EmployeeNumber&gt;1234&lt;/EmployeeNumber&gt;
      &lt;LastName&gt;Doe&lt;/LastName&gt;
      &lt;FirstName&gt;John&lt;/FirstName&gt;
      &lt;JobTitle&gt;Technical Member&lt;/JobTitle&gt;
      &lt;HoursWorked&gt;2000&lt;/HoursWorked&gt;
      &lt;PayRate&gt;30.0&lt;/PayRate&gt;
    &lt;/emp:EmployeeInput&gt;</someNS:EmployeeString>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
