driver-tests/bpelse/xslt/DoXslTransformJBI/test/TestCaseTextContent/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:emp="http://sun.com/EmplInput">
  <soapenv:Body>
    <emp:EmployeeInput>
      <EmployeeNumber>123</EmployeeNumber>
      <LastName>Smith</LastName>
      <FirstName>Bob</FirstName>
      <JobTitle>Code Monkey</JobTitle>
      <HoursWorked>60</HoursWorked>
      <PayRate>50</PayRate>
    </emp:EmployeeInput>
  </soapenv:Body>
</soapenv:Envelope>