driver-tests/bpelse/xpathfunctions/XSDFunctionsJBI/test/results/doMarshalTest/Actual_20130325130719_F.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <EmployeeString xmlns="http://sun.com/EmplInput" xmlns:msgns="http://j2ee.netbeans.org/wsdl/marshal">&lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;emp:EmployeeInput xmlns:emp="http://sun.com/EmplInput" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;&#13;
      &lt;EmployeeNumber&gt;1234&lt;/EmployeeNumber&gt;&#13;
      &lt;LastName&gt;Doe&lt;/LastName&gt;&#13;
      &lt;FirstName&gt;John&lt;/FirstName&gt;&#13;
      &lt;JobTitle&gt;Technical Member&lt;/JobTitle&gt;&#13;
      &lt;HoursWorked&gt;2000&lt;/HoursWorked&gt;&#13;
      &lt;PayRate&gt;30.0&lt;/PayRate&gt;&#13;
    &lt;/emp:EmployeeInput&gt;</EmployeeString>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>