driver-tests/bpelse/xpathfunctions/XSDFunctionsJBI/test/doUnMarshalTest/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <someNS:EmployeeInput xmlns:someNS="http://sun.com/EmplInput">
      <EmployeeNumber>1234</EmployeeNumber>
      <LastName>Doe</LastName>
      <FirstName>John</FirstName>
      <JobTitle>Technical Member</JobTitle>
      <HoursWorked>2000</HoursWorked>
      <PayRate>30.0</PayRate>
    </someNS:EmployeeInput>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
